webapp.b2c/pipes/TestMDM_Soap/xml/Create_New_Product_With_Some_Fields_02_IN.xml

<?xml version="1.0" encoding="UTF-8" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema"><SOAP-ENV:Body><pns:createRecords xmlns:pns='urn:MDMCreateRecordsVi'><ns1:records xmlns:ns1='urn:MDMCreateRecordsVi' xmlns:pns='urn:com.sap.ws.types.generic'><pns:Record><pns:dataElement><pns:field><pns:dataType>STRING</pns:dataType><pns:unifiedField><pns:code>CTN</pns:code><pns:fieldName><pns:language>English [US]</pns:language><pns:name>CTN</pns:name></pns:fieldName></pns:unifiedField></pns:field><pns:simpleValue><pns:position>0</pns:position><pns:unifiedValue><pns:unit></pns:unit><pns:value><pns:language>English [US]</pns:language><pns:value>Lissi CTN Test</pns:value></pns:value></pns:unifiedValue></pns:simpleValue></pns:dataElement><pns:dataElement><pns:field><pns:dataType>STRING</pns:dataType><pns:unifiedField><pns:code>12NC</pns:code><pns:fieldName><pns:language>English [US]</pns:language><pns:name>12NC</pns:name></pns:fieldName></pns:unifiedField></pns:field><pns:simpleValue><pns:position>0</pns:position><pns:remoteKey><pns:clientSystem></pns:clientSystem></pns:remoteKey><pns:unifiedValue><pns:unit></pns:unit><pns:value><pns:language>English [US]</pns:language><pns:value>Lissi 12NC</pns:value></pns:value></pns:unifiedValue></pns:simpleValue></pns:dataElement><pns:recordIdentifier><pns:externalId></pns:externalId><pns:recordId>0</pns:recordId><pns:remoteKey><pns:clientSystem></pns:clientSystem></pns:remoteKey><pns:table><pns:code>Products</pns:code></pns:table></pns:recordIdentifier></pns:Record></ns1:records><ns2:repositoryInformation xmlns:ns2='urn:MDMCreateRecordsVi' xmlns:pns='urn:com.sap.ws.types.generic'><pns:dataLang>English [US]</pns:dataLang><pns:repositoryName>Philips_NEW</pns:repositoryName><pns:repositoryPort>2750</pns:repositoryPort><pns:schemaLang>English [US]</pns:schemaLang><pns:serverName>localhost</pns:serverName></ns2:repositoryInformation><ns3:configurationData xmlns:ns3='urn:MDMCreateRecordsVi' xmlns:pns='urn:com.sap.ws.types.generic'></ns3:configurationData></pns:createRecords></SOAP-ENV:Body></SOAP-ENV:Envelope>